<a href="https://colab.research.google.com/github/muhammadaskar/DATA-MINING/blob/main/naiveBayesDataDisktrit.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
dt = pd.read_excel("/content/sample_data/data testing.xlsx")
dt.head()

   ukuran_sepatu   berat_badan  usia
0              35           40    16
1              36           42    16
2              37           45    17
3              38           50    19
4              39           53    20

In [4]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ukuran_sepatu   15 non-null     int64
 1   berat_badan     15 non-null     int64
 2   usia            15 non-null     int64
dtypes: int64(3)
memory usage: 488.0 bytes

In [5]:
x = dt
x.head(15)

    ukuran_sepatu   berat_badan  usia
0               35           40    16
1               36           42    16
2               37           45    17
3               38           50    19
4               39           53    20
5               40           58    20
6               41           60    22
7               42           63    30
8               43           65    34
9               44           69    36
10              38           52    26
11              39           55    25
12              40           57    23
13              41           43    24
14              42           46    25

In [22]:
y = dt["usia"]
y.head(15)

0     16
1     16
2     17
3     19
4     20
5     20
6     22
7     30
8     34
9     36
10    26
11    25
12    23
13    24
14    25
Name: usia, dtype: int64

In [14]:
from sklearn.model_selection import train_test_split
# Import Gaussian Naive Bayes model
from sklearn.naive_bayes import GaussianNB
# Mengaktifkan/memanggil/membuat fungsi klasifikasi Naive bayes
modelnb = GaussianNB()
# Memasukkan data training pada fungsi klasifikasi naive bayes
nbtrain = modelnb.fit(x, y)
datauji = pd.read_excel("/content/sample_data/data uji.xlsx")
datauji.head(3)

   ukuran_sepatu   berat_badan  usia
0              35           40    30
1              36           42    19
2              37           45    17

In [15]:
x_test = datauji
x_test.head(3)

   ukuran_sepatu   berat_badan  usia
0              35           40    30
1              36           42    19
2              37           45    17

In [16]:
y_uji = datauji["usia"]
y_uji.head(3)

0    30
1    19
2    17
Name: usia, dtype: int64

In [17]:
Y_predict = nbtrain.predict(x_test)
print("Prediksi Naive Bayes : ",Y_predict)

Prediksi Naive Bayes :  [25 20 17]

In [19]:
from sklearn.metrics import accuracy_score
accuracy= accuracy_score(y_uji, Y_predict)
print("Akurasi Naive Bayes : ",accuracy)

Akurasi Naive Bayes :  0.3333333333333333

In [23]:
from sklearn.model_selection import cross_val_score
scores = cross_val_score(modelnb, x, y, cv=2)
scores.mean()

/usr/local/lib/python3.7/dist-packages/sklearn/model_selection/_split.py:667: UserWarning: The least populated class in y has only 1 members, which is less than n_splits=2.
  % (min_groups, self.n_splits)), UserWarning)

0.13392857142857142